Перем _КомандыКластер;
Перем _КомандыПараметры;
Перем _КомандыКонфигуратор;
Перем _КомандыГИТ;

&Пластилин Перем КомандыГИТ Экспорт;
&Пластилин Перем КомандыКонфигуратор Экспорт;
&Пластилин Перем КомандыПараметры Экспорт;
&Пластилин Перем КомандыКластер Экспорт;
&Логер
Перем Лог;

&Опция(Имя = "PathRepository", Описание = "Путь будущего репозитория")
Перем PathRepository;

&Опция(Имя = "PathRemoteRepository", Описание = "Путь удаленного репозитория")
Перем PathRemoteRepository;

&Опция(Имя = "UserName", Описание = "Имя пользователя")
Перем UserName;

&Опция(Имя = "UserEmail", Описание = "Почта пользователя")
Перем UserEmail;


&КомандаПриложения(Имя = "init")
Процедура ПриСозданииОбъекта()
		
КонецПроцедуры

&ВыполнениеКоманды
Процедура ОбработатьКоманду() Экспорт
	НастройкиВыполнения = НастройкиВыполнения();
	ИнициализироватьНастройки(НастройкиВыполнения, Ложь);
	ИнициализироватьГит(, Истина);
	Лог.Информация("Клонирование репозитория успешно завершено");
	Лог.Информация("Обработка завершена");

КонецПроцедуры

Функция НастройкиВыполнения()

	НастройкиВыполнения = Новый Структура;
	НастройкиВыполнения.Вставить("PathRepository", PathRepository);
	НастройкиВыполнения.Вставить("PathRemoteRepository", PathRemoteRepository);
	НастройкиВыполнения.Вставить("UserName", UserName);
	НастройкиВыполнения.Вставить("UserEmail", UserEmail);

	Возврат НастройкиВыполнения;

КонецФункции

#Область Инициализация

Процедура ИнициализироватьКластер() Экспорт
	
	_КомандыКластер = КомандыКластер;
	_КомандыКластер._КомандыПараметры = _КомандыПараметры;

	_КомандыКластер.Инициализировать();
	
КонецПроцедуры


Процедура ИнициализироватьКонфигуратор() Экспорт
	
	_КомандыКонфигуратор = КомандыКонфигуратор;
	_КомандыКонфигуратор._КомандыПараметры = _КомандыПараметры;

	_КомандыКонфигуратор.Инициализировать();
	
КонецПроцедуры

Процедура ИнициализироватьГит(СоздатьРепозиторий = Ложь) Экспорт
	
	_КомандыГИТ = КомандыГИТ;
	_КомандыГИТ._КомандыПараметры = _КомандыПараметры;
	_КомандыГИТ.Инициализировать(СоздатьРепозиторий);

КонецПроцедуры

Процедура ИнициализироватьНастройки(НастройкиВыполнения, ЗапускатьRas) Экспорт
	
	_КомандыПараметры = КомандыПараметры;
	_КомандыПараметры.Параметры = НастройкиВыполнения;

	_КомандыПараметры.ЗапускатьRas = ЗапускатьRas;
	_КомандыПараметры.Инициализировать();
	
КонецПроцедуры

#КонецОбласти